brew "bat"
brew "eza" # replace ls
brew "fd" # replace find
brew "fzf" # fuzzy finder
brew "gh" # github cli
brew "git"
brew "git-delta" # diff viewer
brew "git-lfs"
brew "jq"
brew "lazygit" # TUI for git
brew "mise"
brew "neovim" # editor
brew "ripgrep" # replace grep
brew "starship" # shell prompt
brew "vifm" # tui filer
brew "xsel" # copy from neovim
brew "yq"
brew "zsh"

