tap "homebrew/bundle"

brew "asdf"
brew "bat"
brew "eza"  # replace ls
brew "direnv"
brew "dprint"  # markdown formatter
brew "fd"  # replace find
brew "fzf"  # fuzzy finder
brew "gcc"
brew "gh"  # github cli
brew "git"
brew "git-delta"  # diff viewer
brew "git-lfs"
brew "go"
brew "go-task"  # task runner
brew "jq"
brew "lazygit"  # TUI for git
brew "neovim"  # editor
brew "pipx"  # for python tools
brew "ripgrep"  # replace grep
brew "starship"  # shell prompt
brew "tmux"
brew "vifm"  # tui filer
brew "xsel"  # copy from neovim
brew "yq"
brew "zsh"

