#tap "homebrew/bundle"

# === application management
brew "mas"
# cask "appcleaner"
mas "RunCat", id: 1429033973

# === communication tools
# cask "brave-browser"
cask "firefox"
cask "google-chrome"
# cask "slack"
mas "velja", id: 1607635845  # linkを開く際のブラウザ選択

# === desktop management
cask "raycast"  # 検索 + rectangle
mas "tot", id: 1491071483 # 非常に簡易なメモ

# === docker
cask "rancher"  # dockerd

# === fonts
# cask "font-cica"
# cask "font-hack-nerd-font"
cask "font-hackgen-nerd"

# === git
tap "microsoft/git"
brew "git"
brew "git-lfs"

# === key management
mas "bitwarden", id: 1352778147  # password manager(app store版を利用しないとブラウザの生体認証が利用できない)

# === keyboard, mouse and trackpad management
cask "azookey"
cask "karabiner-elements"  # Alt単体押しによる日本語切り替え
cask "scroll-reverser"  # マウスのみスクロール方向を逆転
cask "handy"  # speech-to-text application

# === LLM
cask "ollama-app"

# === project
brew "bash"

# === programming tools
brew "mise"
# cask "visual-studio-code"

# === recording
# brew "ffmpeg"
cask "obs"

# === terminal
brew "cmake"
brew "gcc"
cask "ghostty"
# brew "luarocks"  # for lazy.nvim plugin -> おそらく lua 導入で不要になっているはず
brew "neovim"  # neovim
brew "pkg-config"
# brew "pngpaste"  # for img-clip.nvim plugin
brew "starship"  # Shell prompt
brew "tmux"
brew "vifm"
brew "wget"
