tap "homebrew/cask"  # 利用していないがエラーが出る場合があるので追加
tap "homebrew/bundle"
# tap "homebrew/core"  # 明示する必要がなくなたので削除

# === C
brew "gcc"

# === docker
brew "docker"  # docker cli
# docker composeは.docker/cli-pluginsにsymlinkを設定するためarm版を利用
# brew "docker-compose"

# === make tool
brew "ninja"

# === node.js
brew "nvm"

# === plotjuggler dependencies
brew "cmake"
brew "qt@5"
brew "protobuf"
brew "mosquitto"
brew "zeromq"
brew "zstd"

# === python
brew "pipx"
brew "pyenv"  # プロジェクトで利用するためasdfではなくpyenvを利用

# === programming tools
brew "direnv"
brew "gh"
brew "go-task"

# === project
brew "bash"
brew "jq"
brew "pwgen"

# === python - pillow
brew "libjpeg"
brew "libtiff"
brew "little-cms2"
brew "webp"

# === python - scipy
brew "openblas"
brew "lapack"
brew "gfortran"

# === terminal
brew "fzf"
brew "git"
brew "git-lfs"
