tap "homebrew/bundle"
# tap "homebrew/cask" # デフォルト対応しているらしいので不要とのこと
# tap "homebrew/core" # デフォルト対応しているらしいので不要とのこと

# === application management
brew "mas"
cask "appcleaner"
mas "RunCat", id: 1429033973

# === communication tools
cask "arc"
# cask "brave-browser"
cask "firefox"
cask "google-chrome"
# cask "microsoft-edge"
cask "slack"
mas "velja", id: 1607635845  # linkを開く際のブラウザ選択
mas "MuteKey", id: 1509590766  # Micのミュート操作用

# === desktop management
cask "rectangle"  # 画面分割とマルチディスプレイでのウィンドウ移動
cask "only-switch"  # スクリーンセーバーの防止など

# === docker
cask "rancher"  # dockerd

# === drone
# cask "qgroundcontrol"  # QGC app
# cask "google-earth-pro"

# === fonts
tap "homebrew/cask-fonts"
cask "font-cica"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"

# === git
tap "microsoft/git"
brew "git"
# brew "git-filter-repo"  # gitの履歴抽出
brew "git-lfs"
# cask "git-credential-manager-core"
brew "lazygit"

# === hugo
# brew "hugo"

# === key management
brew "stoken"  # pass generateor
mas "bitwarden", id: 1352778147  # password manager(app store版を利用しないとブラウザの生体認証が利用できない)

# === keyboard, mouse and trackpad management
cask "karabiner-elements"  # Alt単体押しによる日本語切り替え
cask "maccy"  # クリップボード履歴
cask "scroll-reverser"  # マウスのみスクロール方向を逆転

# === LLM
brew "ollama"

# === plantuml
brew "graphviz"
# brew "java"  # javaはasdfなどを利用してバージョン管理しつつ導入する
brew "plantuml"

# === project
brew "bash"
brew "jq"
brew "pwgen"
brew "licensed"

# === programming tools
# brew "asdf"
brew "cargo-make"
brew "direnv"
brew "dprint"  # markdown formatter
brew "go-task"
brew "mise"
cask "obsidian"
# cask "postman"
cask "visual-studio-code"

# === python
brew "pipx"
# brew "pyenv"  # asdfと重複するので削除

# === recording
brew "ffmpeg"
cask "obs"

# === ruby
# rubyをmiseでインストールするときに必要
brew "autoconf"
brew "gmp"
brew "libyaml"
brew "openssl@3"
brew "readline"

# === rust
# 2024-07-24 rustup-init -> rustupの変更タイミングで正常にインストールできなくなったので公式の方法に従う。
# `curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh`
# see: <https://www.rust-lang.org/ja/tools/install>
# brew "rustup"

# === terminal
# brew "awscli"  # asdfで管理する
brew "bat"
# brew "bitwarden-cli"
brew "eza"  # replace ls -> exa -> eza
brew "fd"  # replace find
brew "fzf"  # fuzzy finder
brew "gcc"
brew "git-delta"  # diff viewer
brew "gh"  # github cli
brew "lualocks"  # for lazy.nvim plugin
brew "neovim"  # neovim
brew "pngpaste"  # for img-clip.nvim plugin
brew "ripgrep"  # replace grep
brew "starship"  # Shell prompt
brew "tmux"
brew "vifm"  # tui filer
brew "wget"
# cask "wezterm"  # terminal emulator
brew "yq"
brew "zellij" # terminal multiplexers
cask "alacritty" # terminal emurator
